CD2DBitmapBrush.#ctor(CRenderTarget*,D2D1_BITMAP_BRUSH_PROPERTIES*,CD2DBrushProperties*,System.Int32)
Constructs a CD2DBitmapBrush object.
pParentTarget: A pointer to the render target.
uiResID: The resource ID number of the resource.
pBitmapBrushProperties: A pointer to the extend modes and the interpolation mode of a bitmap brush.
pBrushProperties: A pointer to the opacity and transformation of a brush.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).